app/views/shared/_feed.html.erb

	<li id="<%= eyre.id %>">
		<span class="content"><%= eyre.description %> - (Qtd. Processos: <%= Item.where("eyre_id = ?", eyre.id).count.to_s %>)</span>
---
SELECT COUNT(*) FROM "items" WHERE (eyre_id = 2)