app/views/eyres/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."eyre_id" = 1 ORDER BY items.created_at DESC
SELECT COUNT(*) FROM "items" WHERE (status = 'EM ORDEM' AND eyre_id = 2)
---
		<hr/>
		<% if @eyre.items.any? %>

SELECT "groups".* FROM "groups" ORDER BY groups.created_at DESC
---
				<td><%= item.process %></td>
				<td><%= item.group %></td>