app/controllers/eyres_controller.rb

  def show
    @groups = Group.all
---
SELECT "groups".* FROM "groups" ORDER BY groups.created_at DESC

  def create
    @eyre = current_user.eyres.build(params[:eyre])
    if @eyre.save
---
INSERT INTO "eyres" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 Aug 2012 00:18:19 UTC +00:00], ["description", "teste de correição"], ["updated_at", Tue, 14 Aug 2012 00:18:19 UTC +00:00], ["user_id", 1]]

  def destroy
    @eyre.destroy
---
DELETE FROM "eyres" WHERE "eyres"."id" = ?  [["id", 1]]