app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups" ORDER BY groups.name asc

  def create
    @group = Group.create(params[:group])
---
INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 14 Aug 2012 02:09:52 UTC +00:00], ["name", "teste"], ["updated_at", Tue, 14 Aug 2012 02:09:52 UTC +00:00]]

  def destroy
    Group.find(params[:id]).destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 25]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? ORDER BY groups.name asc LIMIT 1  [["id", "25"]]