app/controllers/items_controller.rb

  def show
    @item = @eyre.items.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."eyre_id" = 1 AND "items"."id" = ? ORDER BY items.created_at DESC LIMIT 1  [["id", "1"]]

  def edit
    @item = @eyre.items.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."eyre_id" = 1 AND "items"."id" = ? ORDER BY items.created_at DESC LIMIT 1  [["id", "1"]]

  def update
    @item = @eyre.items.find(params[:id])
    if @item.update_attributes(params[:item])
---
SELECT "items".* FROM "items" WHERE "items"."eyre_id" = 1 AND "items"."id" = ? ORDER BY items.created_at DESC LIMIT 1  [["id", "4"]]
UPDATE "items" SET "process" = '22222222222', "updated_at" = '2012-08-14 01:43:08.090049' WHERE "items"."id" = 4

  def create
    @item = @eyre.items.build(params[:item])
    if @item.save
---
INSERT INTO "items" ("created_at", "eyre_id", "group", "last", "obs", "process", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @item = @eyre.items.find(params[:id]).destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."eyre_id" = 1 AND "items"."id" = ? ORDER BY items.created_at DESC LIMIT 1  [["id", "1"]]

  def load_groups
    @groups = Group.all
---
SELECT "groups".* FROM "groups" ORDER BY groups.name asc