app/controllers/static_pages_controller.rb

SELECT "eyres".* FROM "eyres" WHERE "eyres"."user_id" = 1 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "eyres" WHERE "eyres"."user_id" = 1
---
  def home
    if signed_in?
      @eyre  = current_user.eyres.build
      @eyres = current_user.eyres.paginate(page: params[:page])