app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY users.name ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY users.name ASC LIMIT 1  [["id", "1"]]
---
  def show
    @user = User.find(params[:id])